Revit 2027 API
FabricationNetworkChangeService.SetDeletePartFailureState Method
 Set the state to delete or keep the element if errors are posted by changing the service. Set to true so the mappings are applied otherwise false.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDeletePartFailureState(
	bool state
)
Public Sub SetDeletePartFailureState (
	state As Boolean
)
public:
void SetDeletePartFailureState(
	bool state
)
member SetDeletePartFailureState :
        state : bool -> unit
Parameters
state Boolean
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace